import React, { useEffect } from "react";
import s from "./LoyaltyProgram.module.css";
import { scroller, Element } from "react-scroll";
import { useLocation } from "react-router-dom";

const LoyaltyProgram = () => {
  const location = useLocation();

  useEffect(() => {
    const section = location.hash.substring(1);
    scroller.scrollTo(section, {
      duration: 800,
      delay: 0,
      smooth: "easeInOutQuart",
    });
  }, [location]);

  return (
    <div className={s.LoyaltyProgram}>
      <h1>Програма лояльності:</h1>
      <Element name="loyalty-program-section">
        <section className={s.loyalty_program_info}>
          <h2>Про Програму Лояльності</h2>
          <p>
            Наша програма лояльності створена для того, щоб віддячити наших
            вірних клієнтів. Приєднавшись до програми, ви отримаєте можливість
            збирати бали за кожну покупку, які можна буде обміняти на знижки або
            подарунки. Чим більше ви покупаєте, тим більше вигод отримаєте!
          </p>
          <h3>Як це працює:</h3>
          <ol>
            <li>
              <b> Реєстрація:</b> Створіть обліковий запис на нашому сайті та
              приєднайтесь до програми лояльності.
            </li>
            <li>
              <b> Збирання балів:</b> За кожну покупку ви отримаєте бали.
              Кількість балів залежить від суми покупки.
            </li>
            <li>
              <b> Обмін балів:</b> Обмінюйте накопичені бали на знижки або
              подарункові сертифікати.
            </li>
          </ol>
          <h3>Особливі Переваги:</h3>
          <ol>
            <li>
              <b> Ексклюзивні Знижки: </b>Члени програми лояльності отримують
              спеціальні знижки та пропозиції.
            </li>
            <li>
              <b> Подарунки та Сюрпризи: </b> Спеціальні подарунки на ваш день
              народження та інші важливі події.
            </li>
            <li>
              <b>Першочерговий Доступ: </b> Отримайте першочерговий доступ до
              нових колекцій та розпродажів.
            </li>
          </ol>
          <h3>Особливі пропозиції для членів програми:</h3>
          <ol>
            <li>
              <b> Додаткові бали за відгуки: </b> Отримуйте бали за відгуки про
              придбані товари.
            </li>
            <li>
              <b> Ексклюзивні акції: </b> Тільки члени програми лояльності
              отримують доступ до ексклюзивних акцій та спеціальних пропозицій.
            </li>
            <li>
              <b>Приоритетна підтримка: </b> Отримуйте відповіді на свої
              запитання швидше з нашою приоритетною службою підтримки.
            </li>
          </ol>
          <p>
            Тепер кожна ваша покупка стане ще більш вигідною, завдяки нашій
            програмі лояльності. Приєднуйтесь до нас і отримайте свої перші бали
            вже сьогодні!
          </p>
        </section>
      </Element>
      <Element name="gift-certificates-section">
        <section className={s.gift_certificates}>
          <h2>Подарункові Сертифікати</h2>
          <p>
            Шукаєте ідеальний подарунок для своїх друзів або родичів? Наші
            подарункові сертифікати - це чудовий вибір! Вони доступні в різних
            номіналах і можуть бути використані для покупки будь-якого товару на
            нашому сайті.
          </p>
          <h3>Як купити та використати подарункові сертифікати:</h3>
          <ol>
            <li>
              <b>Придбання:</b> Оберіть номінал сертифікату та купіть його
              онлайн або в нашому магазині.
            </li>
            <li>
              <b>Електронна доставка:</b> Отримайте свій сертифікат електронною
              поштою або як фізичний ваучер.
            </li>
            <li>
              <b> Використання:</b> Введіть код сертифікату під час оформлення
              замовлення, щоб скористатись знижкою.
            </li>
          </ol>
          <h3>Чому варто обрати наші сертифікати?</h3>
          <ol>
            <li>
              <b>Гнучкість: </b>Оберіть будь-який товар з нашого асортименту за
              допомогою подарункового сертифікату.
            </li>
            <li>
              <b> Простота використання:</b> Просто введіть унікальний код
              сертифікату при оформленні замовлення.
            </li>
            <li>
              <b> Персоналізація: </b>Додайте особисте повідомлення для
              отримувача, щоб зробити ваш подарунок ще більш особливим.
            </li>
          </ol>
          <p>
            Наши подарункові сертифікати надають можливість зробити вибір
            отримувачеві, що робить їх ідеальним подарунком для будь-якого
            випадку.
          </p>
          <h3>Переваги наших сертифікатів:</h3>
          <ol>
            <li>
              <b>Термін дії:</b> Наші подарункові сертифікати дійсні протягом
              року, тому у ваших друзів та родичів буде достатньо часу, щоб
              вибрати ідеальний товар.
            </li>
            <li>
              <b>Широкий вибір: </b> Сертифікати можна використовувати на
              будь-який товар у нашому магазині, від техніки до одягу.
            </li>
            <li>
              <b>Легкість обміну: </b>Обмін подарункового сертифікату на товар є
              простим та зручним, завдяки нашому онлайн-магазину.
            </li>
          </ol>
          <p>
            Подарункові сертифікати - це не просто подарунок, це можливість
            виразити свою увагу та подбати про приємні враження ваших близьких.
            Придбайте подарунковий сертифікат сьогодні та зробіть свій подарунок
            незабутнім!
          </p>
        </section>
      </Element>
    </div>
  );
};

export default LoyaltyProgram;
