import React, { useEffect } from "react";
import s from "./ServiceCentre.module.css";
import { scroller, Element } from "react-scroll";
import { useLocation } from "react-router-dom";
const ServiceCentre = () => {
  const location = useLocation();
  useEffect(() => {
    const section = location.hash.substring(1);
    scroller.scrollTo(section, {
      duration: 800,
      delay: 0,
      smooth: "easeInOutQuart",
    });
  }, [location]);

  return (
    <div className={s.ServiceCentreContent}>
      <h1>Сервіс:</h1>
      <Element name="service-centers">
        <section>
          <h2>Сервісні центри</h2>
          <p>
            Наші сервісні центри пропонують широкий спектр послуг по ремонту та
            обслуговуванню техніки. Досвідчені майстри швидко та якісно вирішать
            будь-які проблеми з вашим обладнанням.
          </p>
          <p>Адреси наших сервісних центрів:</p>
          <ul>
            <li>м. Вінниця, вул. Соборна, 123</li>
            <li>м. Київ, вул. Шевченка, 123</li>
            <li>м. Львів, вул. Франка, 456</li>
            <li>м. Одеса, вул. Дерибасівська, 789</li>
            <li>м. Донецьк, вул. Перемоги, 1</li>
            <li>м. Харків, вул. Сумська, 012</li>
          </ul>
          <p>Графік роботи: Пн-Пт з 9:00 до 18:00, Сб з 10:00 до 15:00.</p>
          <p>
            Для запису на діагностику або ремонт зателефонуйте нам або заповніть
            форму на сайті.
          </p>
        </section>
      </Element>
      <Element name="service-warranty">
        <section>
          <h2>Сервіс і гарантія</h2>
          <p>
            Ми надаємо гарантію на всю продукцію, продаєму в нашому магазині.
            Гарантійний термін та умови гарантійного обслуговування вказані в
            гарантійному талоні, який видається разом із товаром.
          </p>
          <p>
            У випадку виявлення дефектів або несправностей протягом гарантійного
            терміну, ви можете звернутися в будь-який з наших сервісних центрів.
            Наши майстри проведуть діагностику та виконають ремонт безкоштовно.
          </p>
          <p>
            Для отримання додаткової інформації зателефонуйте нам або зверніться
            до найближчого сервісного центру.
          </p>
          <p>
            Ми прагнемо забезпечити вас комфортом та спокоєм під час
            користування нашою продукцією. Гарантія від нашого магазину — це не
            лише підтвердження якості товару, але й наша підтримка вам на
            кожному етапі експлуатації товару.
          </p>
          <p>
            Всі товари, представлені в нашому магазині, мають відповідні
            сертифікати якості та гарантію від виробника. Гарантійний термін на
            кожен товар може варіюватися та вказаний на гарантійному квитанції,
            який ви отримаєте разом з товаром.
          </p>
          <p>
            У випадку виявлення заводського браку протягом гарантійного терміну,
            ви можете безкоштовно звернутися до будь-якого з наших сервісних
            центрів. Наші кваліфіковані спеціалісти проведуть необхідний ремонт
            або заміну товару.
          </p>
          <p>
            Також ми пропонуємо післягарантійне обслуговування та ремонт. Ми
            використовуємо тільки оригінальні запчастини та рекомендовані
            виробником матеріали, щоб забезпечити надійність та довговічність
            вашого обладнання.
          </p>
          <p>
            Якщо у вас виникли питання щодо гарантійних умов або ви потребуєте
            консультації щодо обслуговування вашого товару, будь ласка,
            зв'яжіться з нашими консультантами за телефоном або електронною
            поштою.
          </p>
          <p>
            Ми завжди раді допомогти вам і забезпечити найвищий рівень сервісу
            та підтримки!
          </p>
        </section>
      </Element>
    </div>
  );
};

export default ServiceCentre;
