import React from "react";
import s from "./Home.module.css";

const Home = () => {
  return (
    <>
      <div className={s.HomeContent}>
        <div className={s.bigText}>ПРО НАС</div>
        Mozok.ua - це інтернет-магазин електроніки в Україні, заснований у 2022
        році Іваном та Марією. Компанія пропонує широкий асортимент товарів від
        провідних виробників, а також гарантує якісне обслуговування та
        оперативну доставку.
        <div className={s.bigText}>ІСТОРІЯ СТВОРЕННЯ</div>У 2020 році Іван та
        Марія, двоє друзів-студентів, заснували інтернет-магазин електроніки
        "Mozok". Вони хотіли створити просту та інтуїтивно зрозумілу платформу,
        де українці могли б купувати електроніку за доступними цінами. Напочатку
        "Mozok" був невеликим бізнесом, але він швидко розвивався. У 2021 році
        компанія відкрила свій перший фізичний магазин у Києві. У 2022 році
        "Mozok" отримав інвестиції від міжнародного фонду венчурного капіталу.
        Сьогодні "Mozok" є одним із найбільших інтернет-магазинів електроніки в
        Україні. Компанія має понад 100 співробітників і пропонує широкий
        асортимент товарів від відомих світових брендів. У 2023 році "Mozok"
        планує розширити свою присутність у регіонах України та відкрити нові
        магазини..
      </div>
    </>
  );
};

export default Home;
