import React from "react";
import s from "./Promotion.module.css";

const Promotion = () => {
  return (
    <div className={s.Promotion}>
      <h1>Aкції:</h1>
      <section className="current-promotions">
        <h2>Актуальні акції</h2>
        <article className="promotion-item">
          <h3>Знижка на смартфони Samsung -10%</h3>
          <p>
            Спеціальна пропозиція для любителів якісної техніки! Придбайте
            смартфони Samsung зі знижкою 10%. Пропозиція діє до кінця місяця.
          </p>
        </article>
        <article className="promotion-item">
          <h3>Бонуси за покупку ноутбуків</h3>
          <p>
            Купуйте ноутбуки в нашому магазині та отримуйте бонусні бали, які
            можна витратити на наступні покупки. Не пропустіть!
          </p>
        </article>
        <article className="promotion-item">
          <h3>Подарунок за покупку телевізору</h3>
          <p>
            Придбайте телевізор та отримайте монтаж та налаштування в подарунок.
            Акція діє до кінця тижня.
          </p>
        </article>
      </section>

      <section className="past-promotions">
        <h2>Минулі акції</h2>
        <article className="promotion-item">
          <h3>Чорна п'ятниця</h3>
          <p>
            Неймовірні знижки до 70% на весь асортимент! Дякуємо, що були з
            нами!
          </p>
        </article>
        <article className="promotion-item">
          <h3>Новорічний розпродаж</h3>
          <p>
            Знижки на всі товари до 50%! Дякуємо за покупки та чекаємо вас
            знову!
          </p>
        </article>
      </section>

      <section className="upcoming-promotions">
        <h2>Майбутні акції</h2>
        <p>
          Наш магазин регулярно проводить акційні пропозиції, щоб ви могли
          отримувати найкращі товари за вигідними цінами. Ми плануємо багато
          захоплюючих акцій, які зроблять ваші покупки ще приємнішими!
        </p>
        <p>
          У нас будуть знижки на електроніку, аксесуари, домашню техніку та
          багато іншого. Також плануються спеціальні пропозиції для постійних
          клієнтів та бонусні програми. Ми впевнені, що кожен зможе знайти щось
          цікаве для себе!
        </p>
        <p>
          Щоб не пропустити наші майбутні акції, рекомендуємо підписатися на
          нашу новинну розсилку. Ми будемо інформувати вас про всі акційні
          пропозиції, спеціальні знижки та бонусні програми завчасно. Також
          слідкуйте за нашими оновленнями у соціальних мережах та на сайті.
        </p>
        <p>
          Ми цінуємо кожного нашого клієнта і прагнемо зробити ваш досвід
          покупок максимально комфортним і вигідним. Чекаємо вас на наших
          майбутніх акціях!
        </p>
      </section>
    </div>
  );
};

export default Promotion;
